index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="brazilian" xml:lang="brazilian">
<head>
<title>Princípios de Engenharia da Computação</title>
<!-- 2019-03-24 Sun 17:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Manoel Vilela, Brizamar Caxias, Bryan Santos" />
<link rel="stylesheet" type="text/css" href="/org-theme/dist/short/bundle.min.css"/>
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
</head>
<body>
<div id="content">
<h1 class="title">Princípios de Engenharia da Computação</h1>
<div class="abstract">
<p>
Olá! Está é a página principal do grupo Princípios da Engenharia da
Computação (PEC). Fundado em 2018, o grupo defende o estudo e desenvolvimentos
de projetos nas áreas de:
</p>

<ul class="org-ul">
<li>Arquitetura e Organização de Computadores
</li>
<li>Sistemas Embarcados
</li>
<li>Circuítos Elétricos
</li>
<li>Eletrônica Digital
</li>
<li>Processamento Digital de Sinais
</li>
<li>Sistemas Operacionais
</li>
<li>Estrutura de Dados
</li>
<li>Programação Computacional
</li>
<li>Redes de Computadores
</li>
</ul>

<p>
Ou seja, os principais pontos onde encontra o ponto mais belo da
computação: o cruzamento entre hardware e software!
</p>

<p>
Os idealizadores do grupo foram os seguintes alunos de Engenharia da Computação
do Campus de Sobral da Universidade Federal do Ceará:
</p>

<ul class="org-ul">
<li>Bryan Santos
</li>
<li>Brizamar Caxias
</li>
<li>Manoel Vilela
</li>
</ul>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Objetivos Gerais</a></li>
<li><a href="#sec-2">2. Projetos dos membros do PEC</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Objetivos Gerais</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Dar ênfase na importância sobre passagem de conhecimento
</li>
<li>Desenvolvimento de projetos Open Source
</li>
<li>Engajar de forma prática através dos conhecimentos teóricos
adquiridos no curso
</li>
<li>Incentivar os alunos a permanência no curso de Engenharia da
Computação
</li>
<li>Ajudar a comunidade acadêmica criar um espírito de determinação e
proatividade
</li>
<li>Aumentar a comunicação entre diferentes áreas do curso (Telecom vs
Automação vs Computação)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Projetos dos membros do PEC</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://logic.lerax.me/">Sistema para geração de tabela verdade escrito em Common Lisp (2017.1)</a>
</li>
<li><a href="https://github.com/ryukinix/data-structures-ufc/">Biblioteca para Estrutura de Dados em C (2017.2)</a>
</li>
<li><a href="https://github.com/ryukinix/audio-effects-matlab">Efeitos de Guitarra utilizando técnicas de Processamento Digital de
Sinais (2017.2)</a>
</li>
<li><a href="https://github.com/ryukinix/mir">Controle Remoto para PC usando Arduino + Python (2018.1)</a>
</li>
<li><a href="https://github.com/ryukinix/python-chat">Sistema de Chat Conferência escrito em Python (2018.2)</a>
</li>
<li><a href="https://github.com/ryukinix/pic-tetris">Tetris implementado em PIC (2018.2)</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-02-10 Sat&gt;</span></span></p>
<p class="author">Author: Manoel Vilela, Brizamar Caxias, Bryan Santos</p>
<p class="date">Created: 2019-03-24 Sun 17:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
